In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:SecureP%40sw0rd%21123@localhost:3306/company_data

In [3]:
%%sql

SELECT * FROM Employees

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('E001', 'Carmel', 26, 'Cape Town'),
 ('E002', 'Stefanie', 56, 'Joburg'),
 ('E003', 'Lisa', 5, 'Nairobi')]

In [5]:
%%sql
show tables

 * mysql+pymysql://root:***@localhost:3306/company_data
4 rows affected.

[('Company_employees',), ('Employee_roles',), ('Employees',), ('Jobs',)]

In [7]:
%%sql

CREATE TABLE States (primary key(State_code)) AS
SELECT distinct State_code, Home_state
FROM Company_employees

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[]

In [8]:
%%sql

SELECT * FROM States

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[(5, 'Nairobi'), (26, 'Cape Town'), (56, 'Joburg')]

In [10]:
%%sql

ALTER TABLE Employees DROP COLUMN Home_state;

 * mysql+pymysql://root:***@localhost:3306/company_data
0 rows affected.

[]

In [11]:
%%sql

SELECT * FROM Employees

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('E001', 'Carmel', 26), ('E002', 'Stefanie', 56), ('E003', 'Lisa', 5)]